prickle/ESP32-Unified-Radio/src/bluetooth.cpp
void avrc_cover_art_srv_set_connected(bool connected)
{
    s_avrc_cover_art_srv_cb.connected = connected;
}

void avrc_cover_art_srv_ca_req(void)
{
    // request cover art 
    if (s_avrc_cover_art_srv_cb.connected) {
        uint8_t attr_mask = ESP_AVRC_MD_ATTR_COVER_ART;

        esp_avrc_ct_send_metadata_cmd(bt_avrc_common_alloc_tl(), attr_mask);
    }
}

void avrc_cover_art_srv_save_image_data(uint8_t *p_data, uint16_t data_len)
{
    s_avrc_cover_art_srv_cb.image_size += data_len;

    uint8_t *p_buf = (uint8_t *)realloc(s_avrc_cover_art_srv_cb.image_data, s_avrc_cover_art_srv_cb.image_size * sizeof(uint8_t));
    if (!p_buf) {
        ESP_LOGE(RC_CA_SRV_TAG, "%s: The memory allocation of Cover art image data failed", __func__);
        avrc_cover_art_srv_free_image_data();
        return;
    }
    s_avrc_cover_art_srv_cb.image_data = p_buf;
    memcpy(s_avrc_cover_art_srv_cb.image_data + s_avrc_cover_art_srv_cb.image_size - data_len, p_data, data_len);
}

void avrc_cover_art_srv_ct_metadata_update(uint8_t *image_handle, int len)
{
    if (s_avrc_cover_art_srv_cb.connected && !s_avrc_cover_art_srv_cb.getting) {
        // check image handle is valid and different with last one, we don't want to get an image repeatedly 
        if (avrc_cover_art_srv_image_handle_check(image_handle, len)) {
            // free the previous image data 
            avrc_cover_art_srv_free_image_data();
            // get the linked thumbnail 
            esp_avrc_ct_cover_art_get_linked_thumbnail(image_handle);
            s_avrc_cover_art_srv_cb.getting = true;
        }
    }
}
*/

#endif